## Production: glue
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_glue_catalog_database.operations_aws_production`          |
|        | `aws_glue_crawler.operations_aws_production_account_tags`      |
|        | `aws_glue_crawler.operations_aws_production_cost_usage_report` |
|        | `aws_glue_security_configuration.s3_encryption`                |
|        | `aws_iam_policy.glue_crawler`                                  |
|        | `aws_iam_role.glue_crawler`                                    |
|        | `aws_iam_role_policy_attachment.aws_glue_service_role`         |
|        | `aws_iam_role_policy_attachment.glue_crawler`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_glue_catalog_database.operations_aws_production will be created
  + resource "aws_glue_catalog_database" "operations_aws_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "Data source path: /operations/aws/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "operations_aws_production"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_crawler.operations_aws_production_account_tags will be created
  + resource "aws_glue_crawler" "operations_aws_production_account_tags" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 1
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "operations_aws_production"
      + id                     = (known after apply)
      + name                   = "Organization Account Tags"
      + role                   = (known after apply)
      + security_configuration = "s3-encryption"
      + table_prefix           = "org_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://mock-raw-bucket/operations/aws/organization"
        }
    }

  # aws_glue_crawler.operations_aws_production_cost_usage_report will be created
  + resource "aws_glue_crawler" "operations_aws_production_cost_usage_report" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 2
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "operations_aws_production"
      + id                     = (known after apply)
      + name                   = "Cost and Usage Report 2.0"
      + role                   = (known after apply)
      + security_configuration = "s3-encryption"
      + table_prefix           = "cost_usage_report_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://mock-raw-bucket/operations/aws/cost-usage-report"
        }
    }

  # aws_glue_security_configuration.s3_encryption will be created
  + resource "aws_glue_security_configuration" "s3_encryption" {
      + id   = (known after apply)
      + name = "s3-encryption"

      + encryption_configuration {
          + cloudwatch_encryption {
              + cloudwatch_encryption_mode = "DISABLED"
            }
          + job_bookmarks_encryption {
              + job_bookmarks_encryption_mode = "DISABLED"
            }
          + s3_encryption {
              + s3_encryption_mode = "SSE-S3"
            }
        }
    }

  # aws_iam_policy.glue_crawler will be created
  + resource "aws_iam_policy" "glue_crawler" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "AWSGlueCrawler-DataLake"
      + name_prefix      = (known after apply)
      + path             = "/service-role/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::mock-transformed-bucket/*",
                          + "arn:aws:s3:::mock-raw-bucket/*",
                          + "arn:aws:s3:::mock-curated-bucket/*",
                        ]
                      + Sid      = "ReadDataLakeS3Buckets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.glue_crawler will be created
  + resource "aws_iam_role" "glue_crawler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AWSGlueCrawler-DataLake"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags_all              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.aws_glue_service_role will be created
  + resource "aws_iam_role_policy_attachment" "aws_glue_service_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "AWSGlueCrawler-DataLake"
    }

  # aws_iam_role_policy_attachment.glue_crawler will be created
  + resource "aws_iam_role_policy_attachment" "glue_crawler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "AWSGlueCrawler-DataLake"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
